docs: reworked
